In [5]:
#creacion

In [8]:
import pandas as pd

In [11]:
dic = {"Primer nombre": ["steven","david","aurelio"],
       "Segundo nombre": ["Felipe","Luis","Daniel"],
      "Estatura_m": [2.08,1.98,3.5],
      "Estudia":["No","Si","No"]}

In [18]:
df= pd.DataFrame(dic);

In [19]:
df["Estatura_in"]= df["Estatura_m"]*39.3701

In [36]:
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,PrimerApellido
Codigo,,,,,,
s1,steven,Felipe,2.08,No,81.889808,Bernal
d1,david,Luis,1.98,Si,77.952798,Ramirez
a1,aurelio,Daniel,3.50,No,137.795350,Coca

In [25]:
df.dtypes

Primer nombre       object
Segundo nombre      object
Estatura_m         float64
Estudia           category
Estatura_in        float64
dtype: object

In [29]:
df["Estudia"]= df["Estudia"].astype("category")

In [31]:
df["PrimerApellido"]=["Bernal","Ramirez","Coca"]

In [32]:
df.shape

(3, 6)

In [33]:
df['Codigo']=['s1','d1','a1']

In [47]:
#df.set_index('Codigo',inplace=True)
df

,Primer nombre,Segundo nombre,Estatura_m,Estudia,Estatura_in,PrimerApellido
Codigo,,,,,,
s1,steven,Felipe,2.08,No,81.889808,Bernal
d1,david,Luis,1.98,Si,77.952798,Ramirez
a1,aurelio,Daniel,3.50,No,137.795350,Coca

In [46]:
#par remover
df.drop(['MCB'],axis=1,inplace=True)

In [43]:
df['MCB'] =['a','b','c']

In [49]:
df = df[["Primer nombre","Segundo nombre","PrimerApellido","Estatura_m","Estatura_in","Estudia"]]

In [50]:
df

,Primer nombre,Segundo nombre,PrimerApellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
s1,steven,Felipe,Bernal,2.08,81.889808,No
d1,david,Luis,Ramirez,1.98,77.952798,Si
a1,aurelio,Daniel,Coca,3.50,137.795350,No

In [52]:
#para convertir
df.to_excel('Datos.xlsx',sheet_name='datos')
df.to_csv('datos.csv')

In [56]:
df.iloc[0]

Primer nombre      steven
Segundo nombre     Felipe
PrimerApellido     Bernal
Estatura_m           2.08
Estatura_in       81.8898
Estudia                No
Name: s1, dtype: object

In [57]:
df.sort_index()

,Primer nombre,Segundo nombre,PrimerApellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
a1,aurelio,Daniel,Coca,3.50,137.795350,No
d1,david,Luis,Ramirez,1.98,77.952798,Si
s1,steven,Felipe,Bernal,2.08,81.889808,No

In [64]:
df.sort_values(by=['Primer nombre'],ascending=True);

In [68]:
df

,Primer nombre,Segundo nombre,PrimerApellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
s1,steven,Felipe,Bernal,2.08,81.889808,No
d1,david,Luis,Ramirez,1.98,77.952798,Si
a1,aurelio,Daniel,Coca,3.50,137.795350,No

In [74]:
filtro = df['Estudia']=="Si"
df[filtro]

,Primer nombre,Segundo nombre,PrimerApellido,Estatura_m,Estatura_in,Estudia
Codigo,,,,,,
d1,david,Luis,Ramirez,1.98,77.952798,Si

In [71]:
filtro

Codigo
s1    False
d1     True
a1    False
Name: Estudia, dtype: bool

In [77]:
df=[~filtro]

In [85]:
filtro2 = (df['Estudia']=="Si") | (df['Estatura_m']<=2.08)
df[filtro2]

TypeError: list indices must be integers or slices, not str